var projects = [{
    "name": "信息安全项目",
    "lists": [{
        "name": "基于QQ聊天的消息加密项目",
        "summary": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "members": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "teacher": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "knowledge": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "time": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
    }, {
        "name": "安全IM及时通信系统",
        "summary": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "members": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "teacher": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "knowledge": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "time": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
    }, {
        "name": "安全云存储项目",
        "summary": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "members": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "teacher": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "knowledge": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "time": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
    }, {
        "name": "安全邮件项目",
        "summary": "安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目",
        "members": "安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目",
        "teacher": "安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目",
        "knowledge": "安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目",
        "time": "安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目",
    }, {
        "name": "基于QQ聊天的消息加密项目",
        "summary": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "members": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "teacher": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "knowledge": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "time": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
    }]
}, {
    "name": "应用软件项目",
    "lists": [{
        "name": "IM及时通信系统",
        "summary": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "members": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "teacher": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "knowledge": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "time": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
    }, {
        "name": "手机ROM闹钟APK",
        "summary": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "members": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "teacher": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "knowledge": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "time": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
    }, {
        "name": "安全邮件项目",
        "summary": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "members": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "teacher": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "knowledge": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "time": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
    }, {
        "name": "手机ROM录音机APK",
        "summary": "安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目",
        "members": "安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目",
        "teacher": "安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目",
        "knowledge": "安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目",
        "time": "安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目安全邮件项目",
    }, {
        "name": "基于QQ聊天的消息加密项目",
        "summary": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "members": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "teacher": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "knowledge": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "time": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
    }]
}, {
    "name": "智能硬件项目",
    "lists": [{
        "name": "无人机项目",
        "summary": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "members": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "teacher": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "knowledge": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "time": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
    }, {
        "name": "智能机器人项目",
        "summary": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "members": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "teacher": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "knowledge": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
        "time": "基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项目项目简介基于QQ聊天的消息加密项",
    }]
}];

var listTemplate = Handlebars.compile($("#list-template").html());

$('#list-div').prepend(listTemplate(projects));

function showDetail() {
    $('#list-div').addClass("infinite");
    $('#detail-div').removeClass("infinite");

    var parentIndex = $(this).parent().find(".title").data("index"),
        index = $(this).data("index");
    var project = projects[parentIndex].lists[index];
    project.type = projects[parentIndex].name;
    project.parentIndex = parentIndex;
    project.index = index;

    var detailTemplate = Handlebars.compile($("#detail-template").html());
    $('#detail-div').empty().prepend(detailTemplate(project));

}

function showProjectList() {
    $('#list-div').removeClass("infinite");
    $('#detail-div').addClass("infinite");
}

function joinProject() {
    var parentIndex = $(this).data("parentIndex"),
        index = $(this).data("index");
    var projectName = encodeURI(projects[parentIndex].lists[index].name);
    window.location.href = "/front/module/join/project.html?projectType=" + parentIndex + ",projectName=" + projectName;
}